projekt/app/controllers/artifacts_controller.rb

  def create
    uuid = SecureRandom.uuid
    uploaded_file = params[:artifact][:file]
    local_file_path = "/var/lib/lightarti/storage/#{uuid}#{uploaded_file.original_filename}"
    puts params[:artifact][:folder_id]
    artifact = Artifact.new(
      name: params[:artifact][:name],
      content_type: uploaded_file.content_type,
      storage_key: local_file_path,
      user_id: current_user.id,
      folder_id: params[:artifact][:folder_id],
      size: uploaded_file.size,
      original_filename: uploaded_file.original_filename

      )
      puts artifact.inspect
    if artifact.save
---
INSERT INTO "artifacts" ("name", "content_type", "size", "user_id", "folder_id", "storage_key", "checksum", "created_at", "updated_at", "original_filename") VALUES ('test', 'image/png', 2478852, 1, 31, '/var/lib/lightarti/storage/e222446c-8476-4721-be4c-8386b71bc638logo_sallingapallehandel.png', NULL, '2026-06-17 07:44:43.857228', '2026-06-17 07:44:43.857228', 'logo_sallingapallehandel.png') RETURNING "id"