projekt/app/controllers/folders_controller.rb

  def index
    if current_user
      @folders = current_user.folders.where(parent_id: nil).sort_by(&:name)
---
SELECT "folders".* FROM "folders" INNER JOIN "folder_permissions" ON "folders"."id" = "folder_permissions"."folder_id" WHERE "folder_permissions"."user_id" = 1 AND "folders"."parent_id" IS NULL

  def create
    @folder = Folder.new(folder_params)
    if @folder.save
      @folder.folder_permissions.create!(user: current_user, role: "admin")
---
INSERT INTO "folders" ("name", "parent_id", "created_at", "updated_at") VALUES ('123', NULL, '2026-06-15 11:39:06.555475', '2026-06-15 11:39:06.555475') RETURNING "id"
INSERT INTO "folder_permissions" ("folder_id", "user_id", "role", "created_at", "updated_at") VALUES (33, 1, 'admin', '2026-06-15 18:13:29.889045', '2026-06-15 18:13:29.889045') RETURNING "id"
INSERT INTO "folders" ("name", "parent_id", "created_at", "updated_at") VALUES ('test123', 32, '2026-06-15 18:13:29.872679', '2026-06-15 18:13:29.872679') RETURNING "id"

  def new
    @folder = Folder.new
    @parent = Folder.find(params[:parent_id]) if params[:parent_id]
---
SELECT "folders".* FROM "folders" WHERE "folders"."id" = 32 LIMIT 1

  def show
    @folder = Folder.find(params[:id])
    @rootfolder = @folder.parent_id.nil?
    @sub_folders = @folder.children.sort_by(&:name)
    @artifacts = Artifact.where(folder_id: @folder.id)
---
SELECT "folders".* FROM "folders" WHERE "folders"."id" = 15 LIMIT 1
SELECT "artifacts".* FROM "artifacts" WHERE "artifacts"."folder_id" = 15

  def close
    @folder = Folder.find(params[:id])
---
SELECT "folders".* FROM "folders" WHERE "folders"."id" = 32 LIMIT 1